darkLabz001/ghosttap/sdkconfig.defaults
# =============================================================
# ESPC5 — Pentest Field Unit
# Waveshare ESP32-C5-LCD-1.47  |  ESP-IDF >= 5.3  (tested on 5.5.x)
# =============================================================

# ---- Target / flash -------------------------------------------------
CONFIG_IDF_TARGET="esp32c5"
CONFIG_IDF_TARGET_ESP32C5=y
CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- FreeRTOS --------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# ---- Console (UART0 = GPIO11 TX / GPIO12 RX on this board) -----------
# The USB port is owned by the command bridge (cmd.c), so the secondary
# USB-Serial-JTAG console must be disabled — otherwise the VFS console
# grabs the USB pins and usb_serial_jtag_driver_install() fails.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ---- Display / LVGL (provided by waveshare BSP + esp_lvgl_port) -----
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=80
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_FATFS_LFN_HEAP=y

# ---- Wi-Fi -----------------------------------------------------------
# Keep SoftAP enabled: AP mode is required for raw 802.11 TX
# (deauth / beacon / probe injection via esp_wifi_80211_tx).
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y

# ---- Bluetooth (NimBLE, BLE 5) ---------------------------------------
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# ---- BLE HID keyboard service (wireless "BadUSB") --------------------
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_SVC_HID_MAX_INSTANCES=1
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=2

# ---- IEEE 802.15.4 (Zigbee / Thread sniffing) ------------------------
# CONFIG_IEEE802154_ENABLED defaults to y on ESP32-C5

# ---- Logging ----------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
